// #3 / 7.9 : Дан следующая структура: let data = [
//     {
//         1: [1, 2, 3],
//         2: [1, 2, 3],
//         3: [1, 2, 3],
//     },
//     {
//         1: [1, 2, 3],
//         2: [1, 2, 3],
//         3: [1, 2, 3],
//     },
//     {
//         1: [1, 2, 3],
//         2: [1, 2, 3],
//         3: [1, 2, 3],
//     },
// ]; Найдите сумму элементов этой структуры.

let data = [
    {
        1: [1, 2, 3],
        2: [1, 2, 3],
        3: [1, 2, 3],
    },
    {
        1: [1, 2, 3],
        2: [1, 2, 3],
        3: [1, 2, 3],
    },
    {
        1: [1, 2, 3],
        2: [1, 2, 3],
        3: [1, 2, 3],
    },
]

// [1,2,3,1,2,3,1,2,3]
// [1,2,3,1,2,3,1,2,3]
// [1,2,3,1,2,3,1,2,3]

// 

// [[1,2,3,1,2,3,1,2,3][1,2,3,1,2,3,1,2,3][1,2,3,1,2,3,1,2,3]]

const sumElement = (arrObj) => arrObj.map((element) => {
    return Object.values(element).flat(Infinity).reduce((acc, item) => acc + item)
}).reduce((acc, item) => acc + item)

console.log(sumElement(data));
